import streamlit as st
from PIL import Image

st.markdown("<h2 style='text-align: center; color: Black;'>รายละเอียดสมุนไพร</h2>", unsafe_allow_html=True)
st.write('')
st.write('')

query_params = st.experimental_get_query_params()
class_name = query_params["class_name"][0] if "class_name" in query_params else None

if class_name=="กระเพราแดง":
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        st.write('')
        image = Image.open('กะเพราแดง.png')
        st.image(image, caption='รูปกะเพราแดง',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #3B130C;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย : กะเพราแดง</br>
        <br>ชื่อวิทยาศาสตร์ : Ocimum tenuiflorum L.</br>
        <br>ชื่อท้องถิ่น     : กอมก้อ,กอมก้อดง(เชียงใหม่)กะเพราขน,กะเพราขาว,กะเพราแดง(ภาคกลาง)ห่อกวอซุ,ห่อตูปลู(กระเหรี่ยง-แม่ฮ่องสอน)อิ่มคิมหลำ(ฉาน-แม่ฮ่องสอน)อีตู่ไทย(ภาคตะวันออกเฉียงเหนือ)</br>
        <br>รสและสรรพคุณ : ทั้งต้น รสเผ็ดร้อน ขับลม แก้ปวดท้อง ท้องเสียและคลื่นไส้อาเจียน</br>
        <br>วิธีการใช้      : แก้อาการท้องอืดท้องเฟ้อ นำใบอ่อนหรือยอดอ่อน 1 กำมือ ต้มให้เดือด กรองเอาน้ำดื่ม หรือปรุงเป็นอาหาร หากใช้ในเด็กให้ตำให้ละเอียดคั้นน้ำแล้วผสมกับมหาหิงค์ ทาบริเวณรอบสะดือและฝ่าเท้าเด็ก</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
    )
elif class_name == 'การบูร':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        st.write('')
        image = Image.open('การบูร.jpg')
        st.image(image, caption='รูปการบูร',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : การบูร</br>
        <br>ชื่อวิทยาศาสตร์ : Cinnamomum camphora (L.) J. Presl.</br>
        <br>ชื่อท้องถิ่น     : พรมเส็ง (ฉาน-ภาคเหนือ); อบเชยญวน (ภาคกลาง)</br>
        <br>รสและสรรพคุณ : เนื้อไม้ รสร้อนปร่าเมา แก้ปวด แก้เคล็ดบวม ขัดยอก แก้พิษแมลงต่อย และโรคผิวหนังเรื้อรัง ขับเหงื่อ ขับเสมหะ ขับปัสสาวะ แก้ไข้หวัด และขับลม บำรุงธาตุ บำรุงกำหนัด ยากระตุ้นหัวใจ \nบำรุงหัวใจ เป็นยาชาเฉพาะที่ เป็นยาระงับประสาทเปลือกและราก แก้ปวดขัดตามเส้นประสาท ข้อบวมเป็นพิษ แก้เคล็ดบวม เส้นสะดุ้ง กระตุก ขัดยอกแพลง แก้ปวดท้อง ท้องร่วง ขับน้ำเหลือง แก้เลือดลม บำรุงกำหนัด ขับเหงื่อ ขับเสมหะ บำรุงธาตุ แก้โรคตา กระจายลม ขับผายลม</br>
        <br>วิธีการใช้      : เนื้อไม้ นำมากลั่นจะได้ “การบูร”  ใช้ทาถูนวดแก้ปวด แก้เคล็ดบวม  หรือนำมาผสมขี้ผึ้ง แก้เคล็ดบวม ปวดเมื่อย แมลงสัตว์กัดต่อย หรือโรคผิวหนังต่างๆ</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
    )
elif class_name == 'ขมิ้นอ้อย':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ขมิ้นอ้อย.jpg')
        st.image(image, caption='รูปขมิ้นอ้อย',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ขมิ้นอ้อย</br>
        <br>ชื่อวิทยาศาสตร์ : Curcuma zedoaria (Christm.) Roscoe</br>
        <br>ชื่อท้องถิ่น     : ขมิ้นขึ้น (ภาคเหนือ); ละเมียด (เขมร); แฮ้วดำ (เชียงใหม่)</br>
        <br>รสและสรรพคุณ : เหง้า  เป็นยาแก้ท้องร่วง อาเจียน แก้ไข้</br>
        <br>วิธีการใช้      : แก้ท้องร่วง ท้องเดิน  นำเหง้าสดประมาณ 2 แว่น บดผสมกับน้ำปูนใส แล้วนำ มาดื่ม เมื่อมีอาการ</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ข่า':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        st.write('')
        image = Image.open('ข่า.jpg')
        st.image(image, caption='รูปข่า',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ข่า</br>
        <br>ชื่อวิทยาศาสตร์ : Alpinia galanga (L.) Willd.</br>
        <br>ชื่อท้องถิ่น     : กฏุกกโรหินี (ภาคกลาง); ข่าหยวก ข่าหลวง  (ภาคเหนือ); สะเอเชย สะเออเคย (กระเหรี่ยง - แม่ฮ่องสอน)</br>
        <br>รสและสรรพคุณ : เหง้าแก่สดหรือแห้ง  รสเผ็ดร้อนขม  แก้อาการท้องอืด ท้องเฟ้อ ปวดท้อง รักษาโรคผิวหนัง (กลากเกลื้อน) แก้โรคบิด แก้ปวดเจ็บ เสียดท้อง แก้ท้องอืดเฟ้อ แก้ไฟลวก น้ำร้อนลวก แก้ลมพิษ และขับน้ำคาวปลา หน่อ รสเผ็ดร้อนหวาน แก้ลมแน่นหน้าอก บำรุงธาตุไฟ</br>
        <br>วิธีการใช้      : ลำต้น ใบ และ ราก ต้มดื่ม ครั้งละ 1 แก้ว ก่อนอาหาร แก้ปวดเข่า</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'จำปา':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('จำปา.jpg')
        st.image(image, caption='รูปจำปา',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : จำปา</br>
        <br>ชื่อวิทยาศาสตร์ : Magnolia champaca (L.) Baill. ex Pierre var. champaca</br>
        <br>ชื่อท้องถิ่น     : จำปากอ (มาเลย์ – ภาคใต้); จำปาเขา (ตรัง); จำปาทอง (นครศรีธรรมราช); จำปาป่า (สุราษฏร์ธานี)</br>
        <br>รสและสรรพคุณ : เปลือกต้น รสฝาด แก้ไข้ บำรุงหัวใจ และขับเสมหะ เนื้อไม้ บำรุงเลือด ขับปัสสาวะดอก มีน้ำมันหอมระเหยใช้เข้ายาไทยเป็นยาบำรุงหัวใจ บำรุงประสาท บำรุงโลหิต แก้คลื่นไส้ แก้ไข้ ขับปัสสาวะ เมล็ด ขับปัสสาวะ</br>
        <br>วิธีการใช้      : 1.แก้ไข้ขูดเปลือกต้นจำปามาต้มกับน้ำ ดื่มครั้งและ 1 แก้ว ก่อนอาหาร เช้าและเย็น 2.บำรุงเลือด ขับปัสสาวะ ใช้เนื้อไม้ สับเป็นชิ้นประมาณนิ้วก้อย 2 -3 ท่อนบุบให้แตกเล็กน้อย ต้มดื่ม ครั้งละ 1 แก้ว ก่อนอาหาร เช้าและเย็น หรือ ใช้เมล็ด 10 – 15 เมล็ด บุบให้แตกเล็กน้อย ต้มดื่ม เพื่อขับปัสสาวะ</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'จำปี':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('จำปี.jpg')
        st.image(image, caption='รูปจำปี',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : จำปี</br>
        <br>ชื่อวิทยาศาสตร์ : Magnolia ×alba (DC.) Figlar</br>
        <br>ชื่อท้องถิ่น     : จุมปี, จุ๋มปี๋ (ภาคเหนือ); แปะหลั่งฮวย (แต้จิ๋ว); ป๋ายหลานฮัว (จีนกลาง)</br>
        <br>รสและสรรพคุณ : เปลือกต้น  แก้ไข้แก่น   บำรุงประจำเดือนดอก   แก้ลม แก้ไข้ บำรุงหัวใจ ขับน้ำดี บำรุงโลหิต</br>
        <br>วิธีการใช้      : ระงับไอ และแก้หลอดลมอักเสบ ใช้ใบแห้ง 10-15 กรัม ต้มนํ้ากิน บำรุงหัวใจ และบำรุงเลือด ดอกจำปี 10 – 15 ดอก ตากแห้ง ต้มดื่ม</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ชมนาด':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ชมนาด.jpg')
        st.image(image, caption='รูปชมนาด',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ชมนาด</br>
        <br>ชื่อวิทยาศาสตร์ : Vallaris glabra (L.) Kuntze.</br>
        <br>ชื่อท้องถิ่น     : ชำมะนาด ชำมะนาดกลาง (ภาคกลาง); ชำมะนาดฝรั่ง ดอกข้าวใหม่ (กรุงเทพฯ); อ้มส้าย (ภาคเหนือ)</br>
        <br>รสและสรรพคุณ : น้ำยางขาวจากลำต้น รักษาบาดแผลภายนอก ทำยาถ่ายอย่างแรง ทำให้อาเจียนเพื่อถ่ายน้ำเหลือง ใช้กระตุ้นกล้ามเนื้อลาย เพิ่มความดันเลือด กระตุ้นมดลูก</br>
        <br>วิธีการใช้      : รักษาบาดแผลภายนอก ใช้น้ำยางทาบริเวณบาดแผล</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ชะเอมไทย':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ชะเอมไทย.jpg')
        st.image(image, caption='รูปชะเอมไทย',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ชะเอมไทย</br>
        <br>ชื่อวิทยาศาสตร์ : Albizia myriophylla Benth.</br>
        <br>ชื่อท้องถิ่น     : ชะเอมป่า (ภาคกลาง); ตาลอ้อย (ตราด); เพาะซูโพ (กระเหรี่ยง-แม่ฮ่องสอน); ย่านงาย (ตรัง); ส้มป่อยหวาน (ภาคเหนือ); อ้อยช้าง (นราธิวาส, สงขลา)</br>
        <br>รสและสรรพคุณ : ราก แก้ไข้เนื้อไม้ รสหวาน แก้โรคในลำคอ แก้ลม แก้เลือดออกตามไรฟัน บำรุงธาตุ บำรุงกำลัง บำรุงกล้ามเนื้อให้เจริญ ขับเสมหะ แก้น้ำตาลเหนียว รักษาอาการปวดฟันเนื่องจากฟันผุใบ รสร้อนเฝื่อน ขับโลหิตระดูดอก รสขมร้อน ช่วยย่อยอาหาร ทำเสมหะให้งวด แก้ดีและโลหิต</br>
        <br>วิธีการใช้      : แก้ไอ ขับเสมหะ ใช้รากยาว 2-4 นิ้ว ต้มน้ำดื่ม เช้า-เย็น ถ้าไม่ทุเลา รับประทานติดต่อกัน 2-4 วันแก้ปวดฟันเนื่องจากฟันผุ นำเนื้อไม้หรือลำต้นชะเอมเทศ มาทุบให้แหลก นำมาเคี้ยว หรือนำมาต้มเคี่ยว เอาแต่น้ำอมกลั้วให้ทั่วทั้งปาก</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ช้าพลู':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ช้าพลู.jpg')
        st.image(image, caption='รูปช้าพลู',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ช้าพลู</br>
        <br>ชื่อวิทยาศาสตร์ : Piper sarmentosum Roxb.</br>
        <br>ชื่อท้องถิ่น     : นมวา (ภาคใต้); ผักปูนา, ผักพลูนก, พลูลิง (ภาคเหนือ); เย่เท้ย (กระเหรี่ยง-แม่ฮ่องสอน)</br>
        <br>รสและสรรพคุณ : ทั้งต้น  รสเผ็ดร้อน ขับเสมหะ แก้เสมหะในทรวงอก ลดระดับน้ำตาลในเลือดราก รสเผ็ดร้อน แก้คูถเสมหะ ขับเสมหะให้ตก ทำให้เสมหะแห้ง ขับลมในลำไส้ บำรุงธาตุใบ รสเผ็ดร้อน  ขับเสมหะ ทำให้เสมหะงวด ทำให้เลือดลมซ่าน เจริญอาหาร เป็นยาขับลมดอก,ผล รสเผ็ดร้อน แก้เสมหะที่คอ ทำให้เสมหะแห้ง ขับลมในลำไส้ ช่วยย่อยอาหาร'</br>
        <br>วิธีการใช้      : นำช้าพลูทั้งต้น มาต้มให้เดือด 15 นาที ดื่มครั้งละ ครึ่งแก้วกาแฟ ก่อนอาหาร เพื่อช่วยขับลม แก้อาการท้องอืด อาหารไม่ย่อยนำมาประกอบอาหารหรือรับประทานสดแบบเมี่ยงคำ เพื่อบำรุงธาตุ ช่วยให้เจริญอาหาร ข้อควรระวัง:ใบช้าพลูสด มีผลึกแคลเซียมออกซาเลตสูง ไม่ควรรับประทานมากเกินไป หรือไม่ควรกินเป็นประจำ จะทำให้เวียนศีรษะ และอาจทำให้เกิดนิ่วในไต หรือทางเดินปัสสาวะได้</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'น้อยหน่า':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('น้อยหน่า.jpg')
        st.image(image, caption='รูปน้อยหน่า',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : น้อยหน่า</br>
        <br>ชื่อวิทยาศาสตร์ : Annona squamosa L.</br>
        <br>ชื่อท้องถิ่น     : หมักเขียบ (ตะวันออกเฉียงเหนือ); ลาหนัง (ปัตตานี); มะนอแน่, มะแน่ (เหนือ); เตียบ (เขมร); หน่อเกล๊ะแซ (เงี้ยว-แม่ฮ่องสอน); มะออจ้า, มะโอจ่า (เงี้ยว-เหนือ)</br>
        <br>รสและสรรพคุณ : ราก รสเฝื่อน ระบายอุจจาระธาตุเปลือกต้น รสฝาดเฝื่อน สมานบาดแผลใบ  รสเฝื่อนเมา แก้ฟกบวม ฆ่าพยาธิผิวหนัง แก้กลากเกลื้อน ฆ่าเหา ฆ่าเชื้อโรคภายในเปลือกผลดิบ รสเฝื่อนเมา แก้งูกัดเมล็ด รสเมามัน ฆ่าพยาธิผิวหนัง ฆ่าหิด ฆ่าเหา</br>
        <br>วิธีการใช้      : ยารักษาเหา ใช้ใบสด 8-12 ใบ หรือเมล็ดที่กะเทาะเปลือกแล้วตำให้ละเอียด 4-5 ช้อนแกง นำมาผสมกับน้ำมันพืช เช่น น้ำมันมะพร้าว หรือน้ำมันถั่วพอเปียกเล็กน้อย (แฉะๆ) ชะโลมบนเส้นผมที่เป็นเหา ทิ้งไว้ประมาณ 1-2 ชั่วโมง สระออกให้หมด ทำเช่นนี้ติดต่อกัน 2-3 วัน ตัวเหา และไข่จะฝ่อหมด หรืออาจจะใช้ความแรงของใบสด หรือเมล็ดน้อยหน่ากับน้ำมันมะพร้าว ความแรง ยารักษาหิด ใช้ใบสดหรือเมล็ดในสด จำนวนไม่จำกัด ตำให้ละเอียด เติมน้ำมันพืชลงไปพอแฉะ ใช้ทาบริเวณที่เป็นหิดวันละ 2-3 ครั้ง จนกว่าจะหาย</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'บอระเพ็ด':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('บอระเพ็ด.jpg')
        st.image(image, caption='รูปบอระเพ็ด',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : บอระเพ็ด</br>
        <br>ชื่อวิทยาศาสตร์ : Tinospora crispa (L.) Hook. f. & Thomson</br>
        <br>ชื่อท้องถิ่น     : เครือเขาฮอ จุ่งจิง (ภาคเหนือ); เจตมูลหนาม (หนองคาย); ตัวเจตมูลยาน เถาหัวด้วน (สระบุรี); หางหนู (สระบุรี,อุบลราชธานี)</br>
        <br>รสและสรรพคุณ : รากและเถา  รสขมเย็น แก้ไข้ ขับเหงื่อ แก้กระหายน้ำ แก้ร้อนในใบ  รสขมเมา แก้รำมะนาด ปวดฟัน แก้ไข้ แก้โรคผิวหนัง ดับพิษปวดแสบปวดร้อน บำรุงน้ำดีผล รสขมแก้ไข้ แก้เสมหะเป็นพิษ</br>
        <br>วิธีการใช้      : แก้ไข้ เถาที่เจริญเต็มที่ ตัดมาประมาณ 50 เซนติเมตร (หรือ 30 – 40 กรัม)  สับเป็นชิ้นเล็กๆ แล้วเติมน้ำในปริมาณเพียงพอ ให้ท่วมยา ต้มเดือด ดื่มยาต้มครั้งละครึ่งแก้ว วันละสองครั้ง เช้า-เย็น ก่อนอาหารข้อควรระวัง  ไม่ควรรับประทานบอระเพ็ดติดต่อกันนาน เนื่องจากจะมีพิษสะสมที่ตับ และมีผลต่อหัวใจ ผู้ที่มีภาวะเอนไซม์ตับบกพร่อง หรือผู้ป่วยที่มีประวัติเป็นโรคตับหรือโรคไต ห้ามใช้บอเพ็ดอย่างเด็ดขาด</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'บัวบก':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('บัวบก.jpg')
        st.image(image, caption='รูปบัวบก',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : บัวบก</br>
        <br>ชื่อวิทยาศาสตร์ : Centella asiatica (L.) A. Braun & Asch</br>
        <br>ชื่อท้องถิ่น     : ปะหนะเอขาเด๊าะ (กระเหรี่ยง-แม่ฮ่องสอน); ผักแว่น (ภาคใต้); ผักหนอก (ภาคเหนือ)</br>
        <br>รสและสรรพคุณ : ทั้งต้น  รสหอมเย็น แก้ช้ำใน แก้อ่อนเพลีย ขับปัสสาวะ รักษาบาดแผล แก้ร้อนในกระหายน้ำ แก้โรคปวดศีรษะข้างเดียว แก้โรคเรื้อน แก้กามโรค แก้ตับอักเสบ บำรุงหัวใจ บำรุงกำลังใบ  รสขม เป็นยาดับร้อน ลดอาการอักเสบ บวม แก้ปวดท้อง แก้บิด แก้ดีซ่าน แก้นิ่วในทางเดินปัสสาวะ แก้ฝีหนอง แก้หัด แก้ไอกรนเมล็ด  รสขมเย็น แก้บิด แก้ไข้ แก้ปวดศีรษะ</br>
        <br>วิธีการใช้      : แก้ร้อนใน กระหายน้ำ ช้ำใน ลดความดันโลหิต ใช้บัวบกสด 1 กำมือ ตำแล้วคั้นเอาแต่น้ำ เติมน้ำตาลทรายเล็กน้อย ดื่มวันละ 3 ครั้ง ติดต่อกันไม่เกิน 7 วันแก้อาการเจ็บคอ ใช้บัวบกสด 1 กำมือ ตำให้ละเอียดแล้วคั้นเอาแต่น้ำ เติมน้ำส้มสายชู 1-3 ช้อน จิบบ่อยๆรับประทานเป็นผักแนม หรือประกอบอาหาร หรือน้ำสมุนไพรบัวบก</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ฝรั่ง':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ฝรั่ง.jpg')
        st.image(image, caption='รูปฝรั่ง',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ฝรั่ง</br>
        <br>ชื่อวิทยาศาสตร์ : Psidium guajava L.</br>
        <br>ชื่อท้องถิ่น     : ฝรั่ง (ภาคกลาง)มะก้วยกา,มะมั่น (ภาคเหนือ)มะก้วย (เชียงใหม่)มะจีน (ตาก)มะกา (แม่ฮ่องสอน; สีดา (นครพนม)ยามุ, ย่าหมู (ภาคใต้); จุ่มโป่(สุราษฏร์ธานี),ชมพู่(ปัตตานี)</br>
        <br>รสและสรรพคุณ : ใบ รสฝาด ดับกลิ่นปาก ดับกลิ่นต่างๆ  แก้ท้องเสียยอดอ่อน รสฝาด แก้บิดปวดเบ่ง แก้ท้องร่วง แก้เสมหะพิการผล ผลอ่อนรสฝาด แก้ท้องเสีย  ผลสุก ช่วยระบายท้อง ดับกลิ่นต่างๆ แก้เลือดออกตามไรฟัน</br>
        <br>วิธีการใช้      : แก้ท้องเสีย ท้องเดิน นำใบสด 4-5 ใบมาปิ้งไฟจนออกสีเหลืองแล้วต้มกับน้ำ 1 ลิตร ดื่มยาต้มเมื่อมีอาการจนกระทั่งอาการดีขี้น หรือเคี้ยวใบฝรั่งอ่อนสด 3 ใบ พร้อมกับเกลือ 1 หยิบมือแล้วกลืน ทำเช่นนี้วันละ 2 ครั้ง หรือนำใบฝรั่ง 6-10 ใบ ชงในน้ำเดือด 2 แก้ว ดื่มยาชง ครั้งละ 1 แก้วห้ามเลือด ใช้ใบสดล้างน้ำให้สะอาด ตำให้ละเอียดพอกแผลที่มีเลือดออก เลือดจะหยุดช่วยระงับกลิ่นปากใช้ใบสด 3-5 ใบ เคี้ยวและคายกากออกทิ้ง</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'พญาสัตบรรณ':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('พญาสัตบรรณ.png')
        st.image(image, caption='รูปพญาสัตบรรณ',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พญาสัตบรรณ</br>
        <br>ชื่อวิทยาศาสตร์ : Alstonia scholaris (L.) R.Br.</br>
        <br>ชื่อท้องถิ่น     : กะโน้ะ(กะเหรี่ยง-แม่ฮ่องสอน)จะบัน(เขมร-ปราจีนบุรี)ชบา,ตีนเป็ด (ภาคกลาง)ตีนเป็ดดำ (นราธิวาส); บะซา, ปูลา, ปูแล (ปัตตานี, มาเลย์-ยะลา); พญาสัตบรรณ (ภาคกลาง); ยางขาว (ลำปาง); สัตบรรณ (ภาคกลาง, เขมร-จันทบุรี); หัสบรรณ (กาญจนบุรี)</br>
        <br>รสและสรรพคุณ : -</br>
        <br>วิธีการใช้      : -</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'พริกไทย':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('พริกไทย.jpg')
        st.image(image, caption='รูปพริกไทย',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พริกไทย</br>
        <br>ชื่อวิทยาศาสตร์ : Piper nigrum L.</br>
        <br>ชื่อท้องถิ่น     : พริกน้อย (ภาคเหนือ)</br>
        <br>รสและสรรพคุณ : ราก รสร้อน แก้ปวดท้อง แก้ลมวิงเวียน ขับลมในลำไส้ ช่วยย่อยอาหาร</br>
        <br>วิธีการใช้      : ใช้เมล็ด 0.5-1 กรัม ประมาณ 15-20 เมล็ด บดเป็นผง ชงรับประทาน 1 ครั้ง หรือ ใส่ปรุงรสในอาหาร</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'พลู':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('พลู.jpg')
        st.image(image, caption='รูปพลู',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พลู</br>
        <br>ชื่อวิทยาศาสตร์ : Piper betle L.</br>
        <br>ชื่อท้องถิ่น     : ซีเก๊ะ (มาเลย์ - นราธิวาส)</br>
        <br>รสและสรรพคุณ : ใบ  รสเผ็ดเมา แก้ปวดฟัน แก้รำมะนาด แก้กลิ่นปาก ขับลมในลำไส้ แก้ท้องอืด ท้องเฟ้อ แก้ปวดท้อง แก้ท้องเสีย แก้ปวดบวม ฟกช้ำ ฆ่าเชื้อโรค หนองฝี แก้อาการอักเสบของเยื่อจมูกและคอ แก้กลาก ลนไฟทาบแก้น้ำกัดเท้า แก้คัน แก้ลมพิษ ลนไฟนาบท้องเด็ก แก้ปวดท้อง</br>
        <br>วิธีการใช้      : อาการแพ้ อักเสบ แมลงสัตว์กัดต่อย ลมพิษ ใช้ใบพลู 1 – 2 ใบ ตำให้ละเอียดผสมกับน้ำเหล้าขาว ทาหรือพอกบริเวณที่เป็น วันละ 2-3 ครั้ง อาการปวดฟันเคี้ยวใบพลูสดและกัดใบพลูบริเวณฟันที่ปวดเป็นเวลา 1-2 นาที</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'พุดซ้อน':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('พุดซ้อน.jpg')
        st.image(image, caption='รูปพุดซ้อน',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พุดซ้อน</br>
        <br>ชื่อวิทยาศาสตร์ : Gardenia jasminoides J. Ellis</br>
        <br>ชื่อท้องถิ่น     : เคดถวา (ภาคเหนือ); แคถวา (เชียงใหม่); พุดจีน พุดใหญ่ (ภาคกลาง); พุทธรักษา (ราชบุรี)</br>
        <br>รสและสรรพคุณ : ราก  รสขมเย็น แก้ไข้ แก้ปวดฟัน แก้เลือดกำเดา เลือดออกตามไรฟัน แก้ปัสสาวะเป็นโลหิต ขับปัสสาวะ แก้ร้อนในใบ รสขมเย็น แก้เคล็ดขัดยอก แก้ปวดศีรษะ และแก้เจ็บส้นเท้าดอก รสเย็น แก้โรคผิวหนัง</br>
        <br>วิธีการใช้      : ตำรับยาโต๊ะบิแด (หมอตำแย) ใช้รากพุดซ้อนฝนรวมกับรากคำแสดและน้ำมะพร้าว ทำให้ท้องมารดาเย็น ช่วยให้ทารกแข็งแรงใบสด ตำพอกแก้เคล็ดขัดยอก พอกแก้ปวดศีรษะ หรือตำกับข้าวสุก พอกแก้เจ็บส้นเท้าดอก ตำคั้นน้ำ ทาแก้โรคผิวหนัง</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'พุทรา':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('พุทรา.jpg')
        st.image(image, caption='รูปพุทรา',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พุทรา</br>
        <br>ชื่อวิทยาศาสตร์ : Ziziphus jujuba Mill.</br>
        <br>ชื่อท้องถิ่น     : พุทราจีน (ภาคกลาง); มะตัน (ภาคเหนือ); มะท้อง (กระเหรี่ยง - กาญจนบุรี); มั่งถั่ง (กระเหรี่ยง – แม่ฮ่องสอน); หมากขอ (ฉาน – แม่ฮ่องสอน)</br>
        <br>รสและสรรพคุณ : ทั้งต้น รสฝาดเฝื่อน แก้บวม  แก้พยาธิ แก้ลงท้อง แก้ตกเลือด แก้ฝีเปลือกต้นและใบ รสฝาดออกเปรี้ยว แก้ท้องเสียลงท้อง แก้อาเจียน แก้อาการจุกเสียดใบ แก้พิษ แมลงสัตว์กัดต่อยผลดิบ รสฝาด แก้ไข้ เป็นยาฝาดสมาน แก้ท้องเสียผลสุก รสหวานฝาดเปรี้ยว เป็นยาระบาย แก้ไอ ขับเสมหะ</br>
        <br>วิธีการใช้      : แก้พิษแมลง ใช้ใบพุทรา 3 - 5 ใบ ขยี้ทา แก้ไข้ แก้ท้องเสีย นำผลพุทราดิบ  หรือ เปลือกต้นพุทรา ฝนกับน้ำดื่มแก้ไอ ขับเสมหะ  รับประทานผลพุทราสด 3 - 5 ใบ เมื่อมีอาการ  หรือ ผลพุทราตากแห้ง ต้มกับกลีบเลี้ยงกระเจี๊ยบแดง เติมน้ำตาลเล็กน้อย ดื่มครั้งละ 1 แก้ว หรือจิบได้บ่อยตามต้องการ</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ฟ้าทะลายโจร':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ฟ้าทะลายโจร.jpg')
        st.image(image, caption='รูปฟ้าทะลายโจร',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ฟ้าทะลายโจร</br>
        <br>ชื่อวิทยาศาสตร์ : Andrographis paniculata (Burm. f.) Wall. ex Nees</br>
        <br>ชื่อท้องถิ่น     : ซีปังกี (จีน); ฟ้าทะลาย (กรุงเทพฯ); หญ้ากันงู (สงขลา)</br>
        <br>รสและสรรพคุณ : ลำต้นและใบ  ก่อนออกดอก รสขม เป็นยาแก้เจ็บคอ แก้ท้องเสีย แก้ไข้ แก้หวัด แก้ปอดอักเสบ แก้บิด เจริญอาหาร ต้มกับเบญจมาศสวน กิน แก้ไส้ติ่งอักเสบ ลดความดันเลือดใบ รสขม รักษาแผลน้ำร้อนลวก ไฟไหม้ แก้คออักเสบ เจ็บคอ ท้องเสีย</br>
        <br>วิธีการใช้      : แก้ไข้ แก้หวัด อาการเจ็บคอ ใช้ใบสด 1 กำมือ เติมน้ำ 4 แก้ว ต้มเดือด 15 นาที  ดื่มยาครั้งละ 1 แก้ว วันละ 3-4 ครั้ง หรือรับประทานฟ้าทะลายโจรแบบผงบรรจุแคปซูล  ครั้งละ 4 แคปซูล วันละ 4 ครั้ง หลังอาหารและก่อนนอนแก้ท้องเสีย นำใบฟ้าทะลายโจรสด บดเป็นผงละเอียด ปั้นกับน้ำผึ้ง เก็บไว้ในขวดแห้ง รับประทานครั้งละ 1.5 กรัม วันละ 4 ครั้ง ก่อนอาหารและก่อนนอน ข้อห้ามใช้และข้อควรระวัง ห้ามใช้ในสตรีมีครรภ์และมารดาที่ให้นมบุตรและในผู้ที่มีประวัติแพ้หรือภูมิไวเกินต่อฟ้าทะลายโจร และในผทมเลอดออกผดปกตควรใชดวยความระมดระวง</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'มะกรูด':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('มะกรูด.jpg')
        st.image(image, caption='รูปมะกรูด',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : มะกรูด</br>
        <br>ชื่อวิทยาศาสตร์ : Citrus hystrix DC.</br>
        <br>ชื่อท้องถิ่น     : มะกรูด (ทั่วไป); มะขุน มะขูด (ภาคเหนือ); มะขู (กระเหรี่ยง – แม่ฮ่องสอน); ส้มกรูด ส้มมั่วผี (ภาคใต้)</br>
        <br>รสและสรรพคุณ : ราก รสจืดเย็น แก้ไข้ ถอนพิษสำแดง แก้ลมจุกเสียดใบ รสปร่าหอม  แก้ไอ ดับกลิ่นคาว แก้ช้ำในผล รสเปรี้ยว กัดเสมหะในลำคอ ฟอกโลหิตประจำเดือน ขับประจำเดือน ขับลม แก้คันศีรษะ แก้รังแคผิวผล  รสหอมป่าร้อน ขับลมในลำไส้ ขับประจำเดือน ขับผายลม</br>
        <br>วิธีการใช้      : แก้รังแค หั่นแบ่งครึ่งผลสด คั้นน้ำ ชโลมบนศีรษะ นวดให้ทั่วและหมักทิ้งไว้ 15-30 นาที แล้วล้างออกด้วยน้ำสะอาด ฟอกโลหิตประจำเดือน ผลมะกรูดสดมาผ่าเป็น 2 ซีก นำไปดองกับเกลือหรือน้ำผึ้งประมาณ 1 เดือน ครบกำหนดแล้วให้รินเอาแต่น้ำมาดื่ม ช่วยฟอกโลหิตได้เป็นอย่างดี</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'มะตูม':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('มะตูม.jpg')
        st.image(image, caption='รูปมะตูม',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : มะตูม</br>
        <br>ชื่อวิทยาศาสตร์ : Aegle marmelos (L.) Corrêa ex Roxb.</br>
        <br>ชื่อท้องถิ่น     : กะทันตาเถร, ตุ่มตัง, ตูม (ปัตตานี); พะโนงค์ (เขมร); มะปิน (ภาคเหนือ); มะปีส่า (กระเหรี่ยง-แม่ฮ่องสอน)</br>
        <br>รสและสรรพคุณ : เปลือกรากและแก่น  แก้ไข้จับสั่น ขับลมในลำไส้ ใบใช้ในพิธีมงคลต่างๆใบสด  รสฝาดมัน แก้หลอดลมอักเสบ แก้บวม แก้หวัด แก้ผดผื่นคัน แก้ตาบวม แก้ตาอักเสบ ผล รสฝาดหวานชุ่ม เป็นยาเย็น แก้ท้องเดิน ท้องเสียเรื้อรัง บำรุงธาตุ แก้เจ็บคอ คออักเสบ ร้อนในปากเปื่อย ขับเสมหะ ขับลม มีฤทธิ์ลดความกำหนัด คลายกังวล และช่วยให้สมาธิดีขึ้น</br>
        <br>วิธีการใช้      : แก้ไข้จับสั่น ขับลมในลำไส้  นำเปลือกรากหรือแก่นมาต้มให้เดือด กินก่อนอาหาร ครั้งละ 1 แก้วกาแฟแก้หลอดลมอักเสบ แก้บวม แก้หวัด  นำใบสดมาคั้นน้ำกิน หรือกินเป็นผักบำรุงธาตุ แก้เจ็บคอ คออักเสบ ร้อนในปากเปื่อย ขับเสมหะ ขับลม มีฤทธิ์ลดความกำหนัด คลายกังวล   นำผลดิบมาหั่น ตากแห้ง ต้มเดือดหรือชงน้ำกิน ครังละ 1 แกว กอนอาหาร</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'มะนาว':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('มะนาว.jpg')
        st.image(image, caption='รูปมะนาว',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : มะนาว</br>
        <br>ชื่อวิทยาศาสตร์ : Citrus aurantifolia (Christm.) Swingle.</br>
        <br>ชื่อท้องถิ่น     : ส้มมะนาว, มะลิว (ภาคเหนือ)</br>
        <br>รสและสรรพคุณ : ราก  รสจืดเย็น แก้ไข้ ถอนพิษ ถอนพิษผิดสำแดง แก้ปวดฝี แก้พิษอักเสบใบ รสปร่า กัดฟอกเสมหะ ฟอกประจำเดือนสตรี น้ำในผล รสเปรี้ยว  แก้เสมหะ แก้ไอ กินแก้เลือด เมล็ด รสขมหอม แก้ซาง ขับเสมหะ แก้ไข้ แก้พิษไข้ร้อน บำรุงน้ำดี</br>
        <br>วิธีการใช้      : แก้เสมหะ แก้ไอ นำมะนาวสด 3-5 ผล คั้นเอาแต่น้ำ เติมเกลือ และน้ำผึ้งหรือน้ำตาลทรายแดงเล็กน้อย จิบบ่อยๆ เมื่อมีอาการ  หรือน้ำมะนาวสด 1 ผล หั่นเป็นชิ้นบางๆ จิ้มเกลือรับประทาน หรือใช้ดอกมะนาวสด 10-15 ดอก ต้มน้ำดื่มขับลม แก้อาการท้องอืด ใช้ผิวมะนาวแห้ง ชงหรือต้มน้ำดื่มแก้ปวดฝี แก้พิษอักเสบ  ใช้รากมะนาวฝนกับสุราทาบริเวณที่มีอาการ หรือใช้ผลมะนาวเผาไฟ ดูดฝีหนอง</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
) 
elif class_name == 'มะระขี้นก':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('มะระขี้นก.jpg')
        st.image(image, caption='รูปมะระขี้นก',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : มะระขี้นก</br>
        <br>ชื่อวิทยาศาสตร์ : Momordica charantia L.</br>
        <br>ชื่อท้องถิ่น     : ผักเหย (สงขลา); ผักไห (นครศรีธรรมราช); มะร้อยรู (ภาคกลาง, ภาคใต้); มะห่อย, มะไห่ (ภาคเหนือ); สุพะซู, สุพะเด (กระเหรี่ยง-แม่ฮ่องสอน)</br>
        <br>รสและสรรพคุณ : ราก  รสขม แก้ไข้ รักษาริดสีดวงทวาร แก้แผลอักเสบ บำรุงธาตุดอก  รสขมร้อน แก้หอบหืดเนื้อผล  รสขม ช่วยให้เจริญอาหาร บำรุงน้ำดี แก้โรคของม้ามและตับ ขับพยาธิ ลดระดับน้ำตาลในเลือด</br>
        <br>วิธีการใช้      : หั่นเป็นชิ้นบางๆ เพื่อปรุงเป็นอาหาร  หรือผ่าซีกตามยาว ลวกจิ้มน้ำพริกผลสด 100 กรัม นำมาผ่าครึ่ง ใช้ช้อนกาแฟขูดไส้ในและเมล็ดออก หั่นเนื้อผลเป็นชิ้นเล็กๆ ใส่ในเครื่องปั่นแยกกาก จะได้น้ำมะระประมาณ 40 มิลลิลิตร ดื่มหลังอาหารเช้าหรือเย็นข้อควรระวัง ผลสุกห้ามรับประทาน จะทำให้มีอาการคลื่นไส้ อาเจียน</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ย่านาง':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ย่านาง.jpg')
        st.image(image, caption='รูปย่านาง',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ย่านาง</br>
        <br>ชื่อวิทยาศาสตร์ : Limacia triandra Miers</br>
        <br>ชื่อท้องถิ่น     : จ้อยนาง (เชียงใหม่) เถาวัลย์เขียว (กลาง) ยาดนาง วันยอ (สุราษฎร์ธานี) เถาร้อยปลา ปู่เจ้าเขาเขียว เถาย่านาง ย่านางขาว ย่านนาง หญ้าภคินี</br>
        <br>รสและสรรพคุณ : ราก รสจืดขม แก้ไข้ แก้พิษเมาเบื่อ กระทุ้งพิษไข้ แก้เมาสุรา ถอนพิษผิดสำแดงใบ  รสจืดขม  ลดพิษในหน่อไม้ ลดระดับน้ำตาลในเลือดใบและดอก  ขับระดู</br>
        <br>วิธีการใช้      : แก้ไข้ ใช้รากแห้งหนัก 15-30 กรัม ต้มกับน้ำ 750 มิลลิลิตร ให้เดือดนาน 15-20 นาที ดื่มครั้งละ 1 ถ้วยกาแฟ ก่อนอาหาร เช้า กลางวัน และเย็นลดระดับน้ำตาลในเลือด โดยใช้ใบย่านางสด 1 กำมือ คั้นกับน้ำ กรองเอาแต่น้ำ ดื่มครั้งละ ½-1 แก้ว วันละ 2-3 ครั้ง ก่อนอาหาร หรือตอนท้องว่าง</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'รางจืด':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('รางจืด.jpg')
        st.image(image, caption='รูปรางจืด',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : รางจืด</br>
        <br>ชื่อวิทยาศาสตร์ : Thunbergia laurifolia Lindl.</br>
        <br>ชื่อท้องถิ่น     : กำลังช้างเผือก ขอบชะนาง เครือเขาเขียว ยาเขียว (ภาคกลาง); คาย รางเย็น (ยะลา); จอลอดิเออ ซั้งกะ ปั้งกะล่ะ พอหน่อเตอ (กะเหรี่ยง-แม่ฮ่องสอน); ดุเหว่า (ปัตตานี); ทิดพุด (นครศรีธรรมราช); น้ำนอง (สระบุรี); ย่ำแย้ แอดแอ (เพชรบูรณ์)</br>
        <br>รสและสรรพคุณ : ราก  แก้เมาค้าง ถอนพิษสุรา ลดพิษสารเคมีตกค้างในร่างกาย เข้ายารักษาโรคอักเสบและปอดบวมเถาและใบ แก้ร้อนในกระหายน้ำ  แก้พิษร้อนต่างๆ</br>
        <br>วิธีการใช้      : ถอนพิษไข้ แก้เมาค้าง และลดสารพิษตกค้างในร่างกาย ใบสด 10-12 ใบคั้นน้ำดื่ม หรือนำมาต้มให้เดือด ดื่ม  หรือใช้ส่วนรากขนาด 1-2 องคุลี ฝนหรือตำกับน้ำซาวข้าว แล้วดื่มให้หมดทันทีที่มีอาการ อาจใช้ซ้ำได้อีกใน 30 นาที ถึง ชั่วโมงต่อมา</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ฝนเสนหา(อบเชย)':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ฝนสเหนหา(อบเชย).jpg')
        st.image(image, caption='รูปฝนสเหนหา(อบเชย)',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : อบเชย</br>
        <br>ชื่อวิทยาศาสตร์ : Cinnamomum bejolghota (Buch.-Ham.) Sweet</br>
        <br>ชื่อท้องถิ่น     : ขนุนมะแวง จวงดง (หนองคาย) เชียกใหญ่(ตรัง) เฉียด บริแวง(ระนอง) ฝนแสนห่า สมุลแว้ง(นครศรีธรรมราช) พะแว โมงหอม มหาปราบ มหาปราบตัวผู้(ภาคใต้) แลงแวง(ปัตตานี) ระแวง(ชลบุรี)</br>
        <br>รสและสรรพคุณ : เปลือก หอมหวาน บำรุงดวงจิต แก้อ่อนเพลัน ทำให้มีกำลัง ขับผายลม แก้โรคหนองในและแก้โทษน้ำคาวปลา แก้ปวดศีรษะ บำรุงกำลัง แก้บิด และไข้สันนิบาต ใบ แก้ลมวิงเวียนและจุกเสียดแน่นและลงท้อง บำรุงกำลัง และบำรุงธาตุ รากกับใบ  แก้ไข้เนื่องจากความอักเสบของสตรีที่คลอดบุตรใหม่ๆ แก้ปวดหลังปวดเอว</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'ว่านหางจระเข้':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('ว่านหางจระเข้.jpg')
        st.image(image, caption='รูปว่านหางจระเข้',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : ว่านหางจระเข้</br>
        <br>ชื่อวิทยาศาสตร์ : Aloe vera (L.) Burm.f.</br>
        <br>ชื่อท้องถิ่น     : ว่านไฟไหม้ (ภาคเหนือ), หางตะเข้ (ภาคกลาง)</br>
        <br>รสและสรรพคุณ : ทั้งต้น รสเย็นเอียน  ช่วยขับน้ำคาวปลา ราก  รสขมขื่น แก้หนองใน แก้มุตกิด ช้ำรั่วใบ รสเย็น แก้ฝี รักษาแผลไฟไหม้ น้ำร้อนลวก ดับพิษร้อน  ป้องกันและบำบัดผิวหนังเกรียมไหม้จากแสงแดดหรือรังสี แผลถลอก รักษาสิวฝ้าและขจัดรอยแผล รักษาโรคกระเพาะอาหาร แก้ร้อนใน ดูดพิษร้อนในร่างกาย บำรุงร่างกาย</br>
        <br>วิธีการใช้      : ใช้ใบ โขลกผสมสุราพอกฝี วุ้นจากใบล้างด้วยน้ำสะอาดทาหรือฝานบางๆ ปิดหรือทาแผลไฟไหม้ น้ำร้อนลวก ดับพิษร้อน ทาผิวป้องกันและรักษาอาการไหม้จากแสงแดด วุ้นรับประทานแก้โรคกระเพาะ บำรุงร่างกาย แก้ร้อนใน ดูดพิษร้อนภายในร่างกาย ใช้ต้น ดองสุราดื่มขับน้ำคาวปลา ใช้ราก รับประทานถ่ายโรคหนองใน น้ำวุ้นจากใบ ล้างด้วยน้ำสะอาด ฝานบางๆ ทาผิวป้องกันและรักษาอาการไหม้จากแสงแดด ทาผิวรักษาสิวฝ้า และขจัดรอยแผลเป็น 5.เนื้อวุ้น เหน็บทวาร รักษาริดสีดวงทวาร</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'สะระแหน่':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('สะระแหน่.jpg')
        st.image(image, caption='รูปสะระแหน่',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : สะระแหน่</br>
        <br>ชื่อวิทยาศาสตร์ : Mentha cordifolia Opiz ex Fresen</br>
        <br>ชื่อท้องถิ่น     : มักเงาะ, สะแน่ (ภาคใต้); สะแน่ (ภาคเหนือ); สะระแหน่สวน (ภาคกลาง); หอมด่วน (ภาคเหนือ)</br>
        <br>รสและสรรพคุณ : ขับลม แก้ปวดหัว แก้ปวดท้อง จุกเสียด แน่นเฟ้อ แก้ลม แก้ฟกบวม แก้แมลงกัดต่อย</br>
        <br>วิธีการใช้ : ใบสด นำมาตำแล้วพอกแก้ปวดบวม ผื่นคัน หรือใบสะระแหน่นำมาชงเป็นชาดื่มบรรเทาอาการหวัด ขับเหงื่อ ระบายความร้อน ขับลมในลำไส้ และช่วยย่อยอาหาร เพราะสารเมนทอลในสะระแหน่มีคุณสมบัติเย็นใช้รักษาอาการอ่อนเพลีย บรรเทาอาการปวดหัวไมเกรน หลอดลมอักเสบ และหอบหืด นอกจากนี้ยังช่วยบรรเทาอาการปวดต่าง ๆ ได้แก่ อาการปวดศีรษะ ปวดฟัน โดยดื่มน้ำต้มใบสะระแหน่ 5 กรัม กับน้ำ 1 ถ้วย ผสมเกลือเล็กน้อย วันละ 2 ครั้ง รักษาอาการบิด ปวดท้อง ท้องร่วง อุจจาระเป็นเลือด โดยนำใบสะระแหน่ต้มดื่มแต่น้ำ แก้พิษแมลงสัตว์กัดต่อย บรรเทาอาการปวดแผล โดยตำใบสะระแหน่ให้ละเอียดพอกบริเวณที่โดนกัด รักษาอาการปวดหู โดยนำน้ำคั้นจากใบสะระแหน่หยอดหูจะช่วยบรรเทาอาการปวดได้ดี  </br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'เสลดพังพอนตัวเมีย':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('สเลดพังพอนตัวเมีย.png')
        st.image(image, caption='รูปสเลดพังพอนตัวเมีย',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : พญาปล้องทอง</br>
        <br>ชื่อวิทยาศาสตร์ : Clinacanthus nutans (Burm.f) Lindau</br>
        <br>ชื่อท้องถิ่น     : ผักมันไก่, ผักลิ้นเขียด (เชียงใหม่); พญาปล้องดำ (ลำปาง); พญายอ (ทั่วไป); โพะโซ่จาง (กระเหรี่ยง-แม่ฮ่องสอน); เสลดพังพอนตัวเมีย (พิษณุโลก)</br>
        <br>รสและสรรพคุณ : ทั้งต้นและใบ  รักษาพิษแมลงสัตว์กัดต่อย  งูสวัด ไฟลามทุ่ม ถอนพิษไข้ และโรคบิดใบ ดับพิษไฟลวก น้ำร้อนลวกราก ขับปัสสาวะ ขับประจำเดือน แก้ปวดเมื่อยบั้นเอว</br>
        <br>วิธีการใช้      : การใช้พญายอรักษาอาการเนื่องจากแมลงกัดต่อยและเริม ตามคำแนะนำของกระทรวงสาธารณสุข (สาธารณสุขมูลฐาน)วิธีการใช้  ขยี้ใบทาบริเวณที่ถูกแมลง สัตว์ กัดต่อย หรือเป็นเริมยาจากสมุนไพรในบัญชียาหลักแห่งชาติครีม ที่มีสารสกัดพญายอร้อยละ 4 – 5สารละลาย (สำหรับป้ายปาก) ที่มีสารสกัดพญายอในกลีเซอรีนร้อยละ 2.5 – 4โลชัน  ที่มีสารสกัดพญายอร้อยละ 1.25วิธีการใช้  ทาบริเวณที่มีอาการ วันละ 5 ครั้งยอดอ่อนมีรสมัน นำมาลวกกินกับน้ำพริก หรือเป็นส่วนประกอบของแกงแค และแกงใส่หน่อไม้แทนใบย่านางเพอลดความขม</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
)
elif class_name == 'สะระแหน่ญี่ปุ่น':
    col1, col2, col3 = st.columns(3)
    with col1:
        st.write('')
    with col2:
        image = Image.open('สะระแหน่ญี่ปุ่น.jpg')
        st.image(image, caption='รูปสะระแหน่ญี่ปุ่น',width=250)
    with col3:
        st.write('')
    st.write(
    """
    <div style='border:3px solid #284243;background-color: #EEF1AB; padding: 0px 30px; border-radius: 20px'>
        <p  font-size: 24px;'>
        <br>ชื่อภาษาไทย   : สะระแหน่ญี่ปุ่น</br>
        <br>ชื่อวิทยาศาสตร์ : Mentha arvensis L. var. piperascens Malinv.</br>
        <br>ชื่อท้องถิ่น     : น้ำมันหม่อง (กรุงเทพฯ)</br>
        <br>รสและสรรพคุณ : ใบ รสเย็น ใบแห้งเป็นยาฆ่าเชื้อโรค พอกแก้ปวดข้อ ขับลม บำรุงธาตุ ขับระดู ขับเหงื่อ ขับปัสสาวะ บำรุงปลายประสาททั้งต้น แก้ปวดศีรษะ แก้ลม แก้ฟกบวม แก้ปวดท้อง จุกเสียดแน่นเฟ้อ</br>
        <br>วิธีการใช้      : ขับลม แก้อาการจุกเสียดแน่น ปวดท้อง ให้ใช้ใบสะระแหน่ 1 กำมือ นำมาปั่นหรือคั้นเป็นน้ำดื่มตอนเช้าและเย็น หรือ ใช้ใบสดขยี้ทาขมับ ช่วยแก้อาการปวดศีรษะ แก้ลม ใบสดขยี้ แล้วสูดดม แก้ฟกช้ำ ใบสดขยี้ทาบริเวณที่ฟกช้ำ</br>
        </p>
    </div>
    """,
    unsafe_allow_html=True
    )

st.write("")
st.write("")

col1, col2 ,col3 = st.columns(3)
with col1:
    button_html = '''
    <style>
        .button-1 {
            background-color: #3B130C; /* Green */
            border: none;
            color: white;
            padding: 10px 60px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: 16px;
            margin: auto;
            cursor: pointer;
            border-radius: 50px;
            white-space: nowrap;
            
        }
        .button-1:hover {
            background-color: #F3885E;
        }
    </style>
    <a href='http://localhost:8501/' target="_blank"><button class="button-1" ><b>🍀 หน้าหลัก</b></button></a>
'''
    st.components.v1.html(button_html, height=50)
with col2:
    button_html = '''
    <style>
        .button-1 {
            background-color: #3B130C; /* Green */
            border: none;
            color: white;
            padding: 10px 50px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: 16px;
            margin: auto;
            cursor: pointer;
            border-radius: 50px;
            white-space: nowrap;
        }
        .button-1:hover {
            background-color: #F3885E;
        }
    </style>
    <a href='http://localhost:8501/Check_Herb' target="_blank"><button class="button-1"><b>🔎 เช็คสมุนไพร</b></button></a>
'''
    st.components.v1.html(button_html, height=50)
with col3:
    button_html = '''
    <style>
        .button-1 {
            background-color: #3B130C; /* Green */
            border: none;
            color: white;
            padding: 10px 40px;
            text-align: center;
            text-decoration: none;
            display: inline-block;
            font-size: 16px;
            margin: auto;
            cursor: pointer;
            border-radius: 50px;
            white-space: nowrap;
        }
        .button-1:hover {
            background-color: #F3885E;
        }
    </style>
    <a href='http://localhost:8501/%E0%B8%84%E0%B8%B9%E0%B9%88%E0%B8%A1%E0%B8%B7%E0%B8%AD%E0%B8%81%E0%B8%B2%E0%B8%A3%E0%B9%83%E0%B8%8A%E0%B9%89%E0%B8%87%E0%B8%B2%E0%B8%99' target="_blank"><button class="button-1"><b>📖 คู่มือการใช้งาน</b></button></a>
'''
    st.components.v1.html(button_html, height=50)
